Repository: TuNa-eTech/ai-photo
Catalog: AIPhotoApp/AIPhotoApp/Resources/*.lproj/Localizable.strings
Languages: vi

# l10n.camera.unavailable
source: Camera not available
vi: Camera không khả dụng

# l10n.image.select
source: Select Photo
vi: Chọn ảnh

# l10n.image.source
source: Choose Photo Source
vi: Chọn nguồn ảnh

# l10n.image.source.library
source: From Library
vi: Từ thư viện

# l10n.image.source.camera
source: Take Photo
vi: Chụp ảnh

# l10n.common.cancel
source: Cancel
vi: Hủy

# l10n.common.success
source: Success
vi: Thành công

# l10n.ads.cannotPresent
source: Unable to present ad.
vi: Không thể hiển thị quảng cáo.

# l10n.credits.buyTitle
source: Buy Credits
vi: Mua Credits

# l10n.credits.buyDesc
source: Buy credit packages at a great price
vi: Mua gói credits với giá ưu đãi

# l10n.credits.buyNow
source: Buy Now
vi: Mua ngay

# l10n.ads.notReady
source: Ad is not ready. Please try again later.
vi: Quảng cáo chưa sẵn sàng. Vui lòng thử lại sau.

# l10n.ads.cannotPresentWithError
source: Unable to present ad: %@
vi: Không thể hiển thị quảng cáo: %@

# l10n.ads.watchError
source: Error while watching ad: %@
vi: Lỗi khi xem quảng cáo: %@

# l10n.auth.googleCannotPresent
source: Cannot present Google sign-in screen.
vi: Không thể trình bày màn hình đăng nhập Google.

# l10n.auth.sessionInvalid
source: Invalid session. Please try again.
vi: Phiên đăng nhập không hợp lệ. Vui lòng thử lại.

# l10n.auth.invalidProfile
source: Please enter a valid name and email.
vi: Vui lòng nhập tên và email hợp lệ.

# l10n.auth.signInFailed
source: Sign in failed. Please try again.
vi: Đăng nhập thất bại. Vui lòng thử lại.

# l10n.profile.avatar
source: Avatar
vi: Ảnh đại diện

# l10n.common.notice
source: Notice
vi: Thông báo

# l10n.common.info
source: Information
vi: Thông tin

# l10n.image.navTitle
source: Select Photo
vi: Chọn ảnh

# l10n.image.cannotLoadTitle
source: Cannot load image
vi: Không thể tải ảnh

# l10n.image.cannotLoadTip
source: Cannot load this image. If it’s stored in iCloud, please download it first and try again.
vi: Không thể tải ảnh này. Nếu ảnh nằm trong iCloud, hãy tải xuống trước rồi thử lại.

# l10n.image.unknownError
source: Unknown error
vi: Lỗi không xác định

# l10n.image.instructions.title
source: Select an image to process
vi: Chọn một ảnh để xử lý

# l10n.image.instructions.subtitle
source: Choose a photo from your library to apply %@ style
vi: Chọn ảnh từ thư viện để áp dụng phong cách %@

# l10n.image.source.hint
source: Choose from library or take a photo
vi: Chọn từ thư viện hoặc chụp ảnh

# l10n.image.process
source: Process Image
vi: Xử lý ảnh

# l10n.camera.unavailable.message
source: This device does not support the camera or is running on the Simulator.
vi: Thiết bị này không hỗ trợ camera hoặc đang chạy trên Simulator.

# l10n.template.new
source: New Template
vi: Mẫu mới

# l10n.credits.notEnoughTitle
source: Not enough Credits
vi: Không đủ Credits

# l10n.credits.header.title
source: You don't have enough credits
vi: Bạn không đủ credits

# l10n.credits.header.subtitle
source: Choose one of the following to continue
vi: Chọn một trong các cách sau để tiếp tục

# l10n.ads.watchTitle
source: Watch Ad
vi: Xem quảng cáo

# l10n.ads.watchDesc
source: Watch an ad to get 1 free credit
vi: Xem quảng cáo để nhận 1 credit miễn phí

# l10n.ads.watchNow
source: Watch now
vi: Xem ngay

# l10n.credits.info
source: Information
vi: Thông tin

# l10n.credits.info.1
source: 1 credit = 1 image processing
vi: 1 credit = 1 lần xử lý ảnh

# l10n.credits.info.2
source: Credits never expire
vi: Credits không bao giờ hết hạn

# l10n.credits.info.3
source: Secure payment via App Store
vi: Thanh toán an toàn qua App Store

# l10n.ads.loading
source: Loading ad...
vi: Đang tải quảng cáo...

# l10n.ads.rewardReceived
source: You received 1 credit!
vi: Bạn đã nhận được 1 credit!

# l10n.ads.mustComplete
source: You must watch the entire ad to receive a credit.
vi: Bạn cần xem hết quảng cáo để nhận credit.

# l10n.ads.userCancelled
source: You closed the ad before completion.
vi: Bạn đã đóng quảng cáo trước khi hoàn thành.

# l10n.profile.section.title
source: Personal Information
vi: Thông tin cá nhân

# l10n.profile.name.placeholder
source: Full Name
vi: Họ và tên

# l10n.profile.error.label
source: Error message
vi: Thông báo lỗi

# l10n.profile.action.continue
source: Continue
vi: Tiếp tục

# l10n.profile.submit.accessibility
source: Submit profile information
vi: Gửi thông tin hồ sơ

# l10n.profile.footer
source: Name and email are required to complete your profile.
vi: Tên và email là bắt buộc để hoàn tất hồ sơ.

# l10n.profile.title
source: Complete Profile
vi: Hoàn tất hồ sơ

# l10n.common.close
source: Close
vi: Đóng

# l10n.auth.welcome.to
source: Welcome to
vi: Chào mừng đến

# l10n.auth.subtitle
source: Turn photos into AI styles
vi: Biến ảnh thành phong cách AI

# l10n.auth.google
source: Continue with Google
vi: Tiếp tục với Google

# l10n.auth.terms.prefix
source: By continuing, you agree to
vi: Bằng việc tiếp tục, bạn đồng ý với

# l10n.auth.terms
source: Terms
vi: Điều khoản

# l10n.auth.privacy
source: Privacy Policy
vi: Chính sách

# l10n.common.processing
source: Processing...
vi: Đang xử lý...

# l10n.auth.appleCredentialMissing
source: Unable to obtain Apple credential.
vi: Không lấy được Apple credential.

# l10n.tab.home
source: Home
vi: Trang chủ

# l10n.tab.projects
source: Projects
vi: Dự án

# l10n.tab.profile
source: Profile
vi: Hồ sơ

# l10n.tab.search
source: Search
vi: Tìm kiếm

# l10n.home.loading
source: Loading…
vi: Đang tải…

# l10n.home.seeAll
source: See All
vi: Xem tất cả

# l10n.home.trendingNow
source: Trending Now
vi: Đang xu hướng

# l10n.home.noTrendingTemplates
source: No more trending templates
vi: Không có mẫu xu hướng nào

# l10n.home.new
source: New
vi: Mới

# l10n.home.noNewTemplates
source: No new templates
vi: Không có mẫu mới

# l10n.home.loadingTemplate
source: Loading trending template...
vi: Đang tải mẫu xu hướng...

# l10n.settings.language
source: Language
vi: Ngôn ngữ

# l10n.language.selectTitle
source: Select Language
vi: Chọn ngôn ngữ

# l10n.language.changedTitle
source: Language Changed
vi: Đã thay đổi ngôn ngữ

# l10n.language.restartMessage
source: Please restart the app to apply the new language.
vi: Vui lòng khởi động lại ứng dụng để áp dụng ngôn ngữ mới.

# l10n.language.vietnamese
source: Vietnamese
vi: Tiếng Việt

# l10n.profile.navTitle
source: Profile
vi: Hồ sơ

# l10n.common.edit
source: Edit
vi: Chỉnh sửa

# l10n.profile.stats.used
source: Used
vi: Đã dùng

# l10n.profile.stats.favorites
source: Favorites
vi: Yêu thích

# l10n.profile.section.account
source: ACCOUNT
vi: TÀI KHOẢN

# l10n.profile.section.preferences
source: PREFERENCES
vi: TÙY CHỌN

# l10n.profile.section.about
source: ABOUT
vi: GIỚI THIỆU

# l10n.profile.buyCredits.title
source: Buy Credits
vi: Mua Credits

# l10n.profile.buyCredits.subtitle
source: Purchase credits to process images
vi: Mua credits để xử lý ảnh

# l10n.profile.edit.title
source: Edit Profile
vi: Chỉnh sửa hồ sơ

# l10n.profile.edit.subtitle
source: Update your information
vi: Cập nhật thông tin của bạn

# l10n.profile.privacy.title
source: Privacy & Security
vi: Quyền riêng tư & Bảo mật

# l10n.profile.privacy.subtitle
source: Manage your data
vi: Quản lý dữ liệu của bạn

# l10n.profile.appearance.title
source: Appearance
vi: Giao diện

# l10n.profile.appearance.subtitle
source: Beige Theme
vi: Chủ đề Beige

# l10n.profile.help.title
source: Help & Support
vi: Trợ giúp & Hỗ trợ

# l10n.profile.help.subtitle
source: FAQs and contact
vi: Câu hỏi thường gặp và liên hệ

# l10n.profile.terms.title
source: Terms of Service
vi: Điều khoản dịch vụ

# l10n.profile.aboutPrivacy.title
source: Privacy Policy
vi: Chính sách quyền riêng tư

# l10n.profile.logout
source: Logout
vi: Đăng xuất

# l10n.profile.logout.confirmTitle
source: Logout
vi: Đăng xuất

# l10n.profile.logout.confirmMessage
source: Are you sure you want to logout?
vi: Bạn có chắc muốn đăng xuất không?

# l10n.profile.deleteAccount
source: Delete Account
vi: Xóa tài khoản

# l10n.profile.delete.confirmTitle
source: Delete Account
vi: Xóa tài khoản

# l10n.profile.delete.confirmMessage
source: This action cannot be undone. All your data will be permanently deleted.
vi: Hành động này không thể hoàn tác. Tất cả dữ liệu của bạn sẽ bị xóa vĩnh viễn.

# l10n.profile.memberSince
source: Member since %@
vi: Thành viên từ %@

# l10n.profile.notifications.title
source: Push Notifications
vi: Thông báo đẩy

# l10n.profile.notifications.subtitle
source: Get updates about new templates
vi: Nhận cập nhật về mẫu mới

# l10n.profile.emailUpdates.title
source: Email Updates
vi: Cập nhật qua email

# l10n.profile.emailUpdates.subtitle
source: Receive newsletters and tips
vi: Nhận bản tin và mẹo hay

# l10n.app.versionLabel
source: %@ • Version %@
vi: %@ • Phiên bản %@

# l10n.profile.placeholder.user
source: User
vi: Người dùng

# l10n.settings.language.hint
source: Double-tap to change app language
vi: Nhấn hai lần để thay đổi ngôn ngữ ứng dụng

# l10n.auth.signin.apple
source: Continue with Apple
vi: Tiếp tục với Apple

# l10n.auth.signin.apple.hint
source: Sign in securely with your Apple ID
vi: Đăng nhập an toàn bằng Apple ID

# l10n.auth.google.hint
source: Sign in with your Google account
vi: Đăng nhập bằng tài khoản Google

# l10n.common.error
source: Error
vi: Lỗi

# l10n.common.save
source: Save
vi: Lưu

# l10n.common.share
source: Share
vi: Chia sẻ

# l10n.common.retry
source: Retry
vi: Thử lại

# l10n.common.loading
source: Loading...
vi: Đang tải...

# l10n.common.seeAll
source: See All
vi: Xem tất cả

# l10n.common.settings
source: Settings
vi: Cài đặt

# l10n.common.done
source: Done
vi: Xong

# l10n.common.fav
source: Fav
vi: Yêu thích

# l10n.credits.balance
source: Credits Balance
vi: Số dư Credits

# l10n.credits.active
source: Active
vi: Đang hoạt động

# l10n.credits.choosePackage
source: Choose a Package
vi: Chọn gói

# l10n.credits.plan.subtitle
source: Select the perfect plan for you
vi: Chọn gói phù hợp với bạn

# l10n.credits.noProducts
source: No products available
vi: Không có sản phẩm

# l10n.credits.checkConnection
source: Please check your connection and try again
vi: Vui lòng kiểm tra kết nối và thử lại

# l10n.credits.bestValue
source: BEST VALUE
vi: GIÁ TỐT NHẤT

# l10n.search.title
source: Search
vi: Tìm kiếm

# l10n.search.searching
source: Searching…
vi: Đang tìm…

# l10n.search.tryDifferent
source: Try different keywords or filters
vi: Hãy thử từ khóa hoặc bộ lọc khác

# l10n.search.hint
source: Search for templates by name, category, or tag
vi: Tìm mẫu theo tên, danh mục hoặc thẻ

# l10n.search.categoryFilters
source: Category filters
vi: Bộ lọc danh mục

# l10n.search.templateFilters
source: Template filters
vi: Bộ lọc mẫu

# l10n.search.filter
source: Filter
vi: Bộ lọc

# l10n.search.start
source: Start searching
vi: Bắt đầu tìm kiếm

# l10n.search.noResults
source: No results found
vi: Không tìm thấy kết quả

# l10n.templates.loading
source: Loading templates...
vi: Đang tải danh sách mẫu...

# l10n.templates.all
source: All Templates
vi: Tất cả mẫu

# l10n.templates.none
source: No Templates Found
vi: Không tìm thấy mẫu nào

# l10n.templates.loadMore
source: Load More
vi: Tải thêm

# l10n.templates.preview
source: Preview
vi: Xem trước

# l10n.templates.addFavorite
source: Add Favorite
vi: Thêm yêu thích

# l10n.templates.removeFavorite
source: Remove Favorite
vi: Bỏ yêu thích

# l10n.projects.title
source: My Projects
vi: Dự án của tôi

# l10n.projects.completed
source: Completed
vi: Hoàn thành

# l10n.projects.details
source: Project Details
vi: Chi tiết dự án

# l10n.projects.delete
source: Delete
vi: Xóa

# l10n.projects.deleteTitle
source: Delete Project
vi: Xóa dự án

# l10n.projects.confirmDelete
source: Are you sure you want to delete "%@"? This action cannot be undone.
vi: Bạn có chắc muốn xóa "%@"? Hành động này không thể hoàn tác.

# l10n.projects.deleteFailed
source: Delete Failed
vi: Xóa thất bại

# l10n.projects.noneTitle
source: No Projects Yet
vi: Chưa có dự án

# l10n.projects.noneSubtitle
source: Start creating amazing images with AI templates!
vi: Bắt đầu tạo ảnh tuyệt vời với các mẫu AI!

# l10n.projects.explore
source: Explore Templates
vi: Khám phá Mẫu

# l10n.result.title
source: Result
vi: Kết quả

# l10n.result.doubleTapZoom
source: Double‑tap to zoom
vi: Nhấn đúp để phóng to

# l10n.photo.savedTitle
source: Saved
vi: Đã lưu

# l10n.photo.savedMessage
source: Image has been saved to your Photos.
vi: Ảnh đã được lưu vào Ảnh.

# l10n.photo.permissionTitle
source: Permission Required
vi: Cần cấp quyền

# l10n.photo.permissionMessage
source: Please enable photo library access in Settings to save images.
vi: Vui lòng bật quyền truy cập thư viện ảnh trong Cài đặt để lưu ảnh.

# l10n.credits.get
source: Get Credits
vi: Mua Credits

# l10n.common.retryVerb
source: Retry
vi: Thử lại

# l10n.greeting.user
source: Hello %@
vi: Chào %@

# l10n.share.previewTitle
source: My AI Image
vi: Ảnh AI của tôi

# l10n.debug.noUrl
source: No URL
vi: Không có URL

# l10n.debug.failedWithError
source: Failed: %@
vi: Thất bại: %@

# l10n.search.prompt
source: Search templates…
vi: Tìm mẫu…

# l10n.processing.title.ready
source: Ready to Process
vi: Sẵn sàng xử lý

# l10n.processing.title.preparing
source: Preparing Image...
vi: Đang chuẩn bị ảnh...

# l10n.processing.title.uploading
source: Uploading Image...
vi: Đang tải ảnh lên...

# l10n.processing.title.processing
source: Processing with AI...
vi: Đang xử lý bằng AI...

# l10n.processing.title.background
source: Processing in Background
vi: Đang xử lý ở chế độ nền

# l10n.processing.title.completed
source: Complete! ✓
vi: Hoàn thành! ✓

# l10n.processing.title.failed
source: Processing Failed
vi: Xử lý thất bại

# l10n.processing.msg.idle
source: Starting image processing
vi: Bắt đầu xử lý ảnh

# l10n.processing.msg.preparing
source: Optimizing your image for AI processing
vi: Tối ưu hóa ảnh của bạn để xử lý AI

# l10n.processing.msg.uploading
source: Sending to AI server
vi: Gửi đến máy chủ AI

# l10n.processing.msg.processing
source: Applying %@ style... This may take 30-60 seconds
vi: Đang áp dụng phong cách %@... Có thể mất 30-60 giây

# l10n.processing.msg.background
source: You can close the app - we'll notify when done
vi: Bạn có thể đóng ứng dụng - chúng tôi sẽ thông báo khi hoàn thành

# l10n.processing.msg.completed
source: Your image is ready!
vi: Ảnh của bạn đã sẵn sàng!

# l10n.photo.accessibility.saveToPhotos
source: Save image to Photos
vi: Lưu ảnh vào Ảnh

# l10n.projects.viewAll
source: View All Projects
vi: Xem tất cả dự án
